#### Terraform format & style 🖌: `success`
#### Terraform initialization ⚙️: `success`
#### Terraform validation 🤖: Success! The configuration is valid.

#### Terraform plan 📖: `success`

<details><summary>Show plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/dosedecafeine/go-example-argocd/runs/run-ATpJuTiXyjGZ52ao

Waiting for the plan to start...

Terraform v1.1.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "go-example-argocd"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Actor: @danielvincenzi, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure as a code`*